# Funciones lambda y el método apply de Pandas

In [1]:
# lambda arguments : expression

suma = lambda x, y: x + y
suma(2, 3)

5

In [2]:
import pandas as pd

In [3]:
data = {
    'numeros': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'letras': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
}

df = pd.DataFrame(data)
df

   numeros letras
0        1      a
1        2      b
2        3      c
3        4      d
4        5      e
5        6      f
6        7      g
7        8      h
8        9      i
9       10      j

In [4]:
df['cuadrado'] = df['numeros'].apply(lambda x: x**2)

In [5]:
df

   numeros letras  cuadrado
0        1      a         1
1        2      b         4
2        3      c         9
3        4      d        16
4        5      e        25
5        6      f        36
6        7      g        49
7        8      h        64
8        9      i        81
9       10      j       100

## Uso de funciones def con apply

In [ ]:
def clasificar_paridad(numero):
    if numero % 2 == 0:
        return 'Par'
    else:
        return 'Impar'
    
df['paridad'] = df['numeros'].apply(lambda x: clasificar_paridad(x))

In [7]:
df

   numeros letras  cuadrado paridad
0        1      a         1   Impar
1        2      b         4     Par
2        3      c         9   Impar
3        4      d        16     Par
4        5      e        25   Impar
5        6      f        36     Par
6        7      g        49   Impar
7        8      h        64     Par
8        9      i        81   Impar
9       10      j       100     Par

# Indices en un DataFrame

## Reestablecer el índice.

In [18]:
data = {
    'nombres': ['Pablo', 'Pedro', 'Juan', 'Carlos', 'Marco', 'Daniel'],
    'edades': [20, 31, 22, 23, 34, 35]
}

df = pd.DataFrame(data)

In [23]:
df_filtrar = df[df['edades'] > 30]
df_filtrar

  nombres  edades
1   Pedro      31
4   Marco      34
5  Daniel      35

In [25]:
df_rest_index = df_filtrar.reset_index()
df_rest_index

   index nombres  edades
0      1   Pedro      31
1      4   Marco      34
2      5  Daniel      35